# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0x6 backbone
backbone:
 # [from, repeats, module, args]
 - [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
 - [-1, 1, SPDConv, [128]] # 1-P2/4
 - [-1, 3, C3, [128]]
 - [-1, 1, SPDConv, [256]] # 3-P3/8
 - [-1, 6, C3, [256]]
 - [-1, 1, SPDConv, [512]] # 5-P4/16
 - [-1, 6, C3, [512]]
 - [-1, 1, SPDConv, [768]] # 7-P5/32
 - [-1, 3, C3, [768]]
 - [-1, 1, SPDConv, [1024]] # 9-P6/64
 - [-1, 3, C3, [1024]]
 - [-1, 1, SPPF, [1024, 5]] # 11
 
# YOLOv8.0x6 head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P5
  - [-1, 3, C3, [768, False]] # 14
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3, [512, False]] # 17
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3, [256, False]] # 20 (P3/8-small)
  # - [-1, 1, GAMAttention, [256, 256]] # 21
  - [-1, 1, TripletAttention, [256]]
  # - [-1, 1, EMA, [256]]
 
  - [-1, 1, SPDConv, [256]]
  - [[-1, 17], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3, [512, False]] # 24 (P4/16-medium)
  # - [-1, 1, GAMAttention, [512, 512]] #25
  - [-1, 1, TripletAttention, [512]]
  # - [-1, 1, EMA, [512]]
 
  - [-1, 1, SPDConv, [512]]
  - [[-1, 14], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3, [768, False]] # 23 (P5/32-large)
  # - [-1, 1, GAMAttention, [768, 768]] #29
  - [-1, 1, TripletAttention, [768]]
  # - [-1, 1, EMA, [768]]
 
  - [-1, 1, SPDConv, [768]]
  - [[-1, 11], 1, Concat, [1]] # cat head P6
  - [-1, 3, C3, [1024, False]] # 23 (P5/32-large)
  # - [-1, 1, GAMAttention, [1024, 1024]] #33
  - [-1, 1, TripletAttention, [1024]]
  # - [-1, 1, EMA, [1024]]
 
  - [[21, 25, 29, 33], 1, Detect, [nc]] # Detect(P3, P4, P5, P6)